Tekla.Structures.Drawing.CannotPerformOperationDrawingMustBeActiveException
The CannotPerformOperationDrawingMustBeActiveException class defines the
exception that is thrown when a user tries to do an operation which
requires that the drawing is active.

Tekla.Structures.Drawing.CannotPerformOperationDrawingMustBeActiveException.#ctor(System.String)
Creates a new cannot perform operation drawing must be active exception instance.
Message: The exception message.

Tekla.Structures.Drawing.CannotPerformOperationDrawingMustBeActiveException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Initializes a new instance with serialized data.
info: The object that holds the serialized object data.
context: The contextual information about the source or destination.